Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/edc/PIC32CM2532JH01064.PIC
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="CFDCTRL" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x40001416">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="CFDEN" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Enable"/>
            <edc:SFRFieldDef edc:cname="SWBACK" edc:nzwidth="0x1" edc:desc="Clock Switch Back Enable"/>
            <edc:SFRFieldDef edc:cname="CFDPRESC" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40001417">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="CFDEO" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="OSC32K" edc:nzwidth="0x20" edc:access="---------nnnnnnn---n-nnnnn--nnn-" edc:por="00000000001111110000000010000000" edc:mclr="00000000001111110000000010000000" edc:impl="0x7F17CE" edc:_addr="0x40001418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:nzwidth="0x1" edc:desc="32kHz Output Enable"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:nzwidth="0x1" edc:desc="1kHz Output Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x3" edc:desc="Oscillator Start-Up Time">
              <edc:SFRFieldSemantic edc:cname="CYCLE3" edc:desc="0.183 ms" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4" edc:desc="0.214 ms" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE6" edc:desc="0.275 ms" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE10" edc:desc="0.397 ms" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE18" edc:desc="0.641 ms" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE34" edc:desc="1.129 ms" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE66" edc:desc="2.106 ms" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE130" edc:desc="4.059 ms" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:nzwidth="0x7" edc:desc="Oscillator Calibration"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="OSCULP32K" edc:nzwidth="0x20" edc:access="----------------n---------------" edc:impl="0x8000" edc:_addr="0x4000141C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3E0" edc:_addr="0x40001420"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x40001800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BODVDDRDY" edc:nzwidth="0x1" edc:desc="BODVDD Ready"/>
            <edc:SFRFieldDef edc:cname="BODVDDDET" edc:nzwidth="0x1" edc:desc="BODVDD Detection"/>
            <edc:SFRFieldDef edc:cname="BVDDSRDY" edc:nzwidth="0x1" edc:desc="BODVDD Synchronization Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x40001804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BODVDDRDY" edc:nzwidth="0x1" edc:desc="BODVDD Ready"/>
            <edc:SFRFieldDef edc:cname="BODVDDDET" edc:nzwidth="0x1" edc:desc="BODVDD Detection"/>
            <edc:SFRFieldDef edc:cname="BVDDSRDY" edc:nzwidth="0x1" edc:desc="BODVDD Synchronization Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x40001808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BODVDDRDY" edc:nzwidth="0x1" edc:desc="BODVDD Ready"/>
            <edc:SFRFieldDef edc:cname="BODVDDDET" edc:nzwidth="0x1" edc:desc="BODVDD Detection"/>
            <edc:SFRFieldDef edc:cname="BVDDSRDY" edc:nzwidth="0x1" edc:desc="BODVDD Synchronization Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x4000180C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BODVDDRDY" edc:nzwidth="0x1" edc:desc="BODVDD Ready"/>
            <edc:SFRFieldDef edc:cname="BODVDDDET" edc:nzwidth="0x1" edc:desc="BODVDD Detection"/>
            <edc:SFRFieldDef edc:cname="BVDDSRDY" edc:nzwidth="0x1" edc:desc="BODVDD Synchronization Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="BODVDD" edc:nzwidth="0x20" edc:access="----------nnnnnnnnnn---n-nnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF17E" edc:_addr="0x40001810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:nzwidth="0x1" edc:desc="Hysteresis Enable"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action when Threshold Crossed">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="The BODVDD generates a reset" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="The BODVDD generates an interrupt" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STDBYCFG" edc:nzwidth="0x1" edc:desc="Configuration in Standby mode"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTCFG" edc:nzwidth="0x1" edc:desc="Configuration in Active mode"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PSEL" edc:nzwidth="0x4" edc:desc="Prescaler Select">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide clock by 2" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide clock by 4" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide clock by 8" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide clock by 16" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide clock by 32" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide clock by 64" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide clock by 128" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide clock by 256" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="Divide clock by 512" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide clock by 1024" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="DIV2048" edc:desc="Divide clock by 2048" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="DIV4096" edc:desc="Divide clock by 4096" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="DIV8192" edc:desc="Divide clock by 8192" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="DIV16384" edc:desc="Divide clock by 16384" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="DIV32768" edc:desc="Divide clock by 32768" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="DIV65536" edc:desc="Divide clock by 65536" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:nzwidth="0x6" edc:desc="Threshold Level for VDD"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
