Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/edc/PIC32CM2532JH01064.PIC
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="CONFIG1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40002820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="SENSE8" edc:nzwidth="0x3" edc:desc="Input Sense Configuration 8">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising edge detection" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling edge detection" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both edges detection" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High level detection" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low level detection" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FILTEN8" edc:nzwidth="0x1" edc:desc="Filter Enable 8"/>
            <edc:SFRFieldDef edc:cname="SENSE9" edc:nzwidth="0x3" edc:desc="Input Sense Configuration 9">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising edge detection" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling edge detection" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both edges detection" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High level detection" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low level detection" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FILTEN9" edc:nzwidth="0x1" edc:desc="Filter Enable 9"/>
            <edc:SFRFieldDef edc:cname="SENSE10" edc:nzwidth="0x3" edc:desc="Input Sense Configuration 10">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising edge detection" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling edge detection" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both edges detection" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High level detection" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low level detection" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FILTEN10" edc:nzwidth="0x1" edc:desc="Filter Enable 10"/>
            <edc:SFRFieldDef edc:cname="SENSE11" edc:nzwidth="0x3" edc:desc="Input Sense Configuration 11">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising edge detection" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling edge detection" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both edges detection" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High level detection" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low level detection" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FILTEN11" edc:nzwidth="0x1" edc:desc="Filter Enable 11"/>
            <edc:SFRFieldDef edc:cname="SENSE12" edc:nzwidth="0x3" edc:desc="Input Sense Configuration 12">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising edge detection" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling edge detection" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both edges detection" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High level detection" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low level detection" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FILTEN12" edc:nzwidth="0x1" edc:desc="Filter Enable 12"/>
            <edc:SFRFieldDef edc:cname="SENSE13" edc:nzwidth="0x3" edc:desc="Input Sense Configuration 13">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising edge detection" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling edge detection" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both edges detection" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High level detection" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low level detection" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FILTEN13" edc:nzwidth="0x1" edc:desc="Filter Enable 13"/>
            <edc:SFRFieldDef edc:cname="SENSE14" edc:nzwidth="0x3" edc:desc="Input Sense Configuration 14">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising edge detection" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling edge detection" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both edges detection" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High level detection" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low level detection" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FILTEN14" edc:nzwidth="0x1" edc:desc="Filter Enable 14"/>
            <edc:SFRFieldDef edc:cname="SENSE15" edc:nzwidth="0x3" edc:desc="Input Sense Configuration 15">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No detection" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Rising edge detection" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Falling edge detection" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Both edges detection" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="High level detection" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Low level detection" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FILTEN15" edc:nzwidth="0x1" edc:desc="Filter Enable 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40002824"/>
      <edc:SFRDef ltx:memberofperipheral="EIC" edc:cname="DEBOUNCEN" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40002830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EIC">
            <edc:SFRFieldDef edc:cname="DEBOUNCEN0" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT0"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN1" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT1"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN2" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT2"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN3" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT3"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN4" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT4"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN5" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT5"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN6" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT6"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN7" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT7"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN8" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT8"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN9" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT9"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN10" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT10"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN11" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT11"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN12" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT12"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN13" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT13"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN14" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT14"/>
            <edc:SFRFieldDef edc:cname="DEBOUNCEN15" edc:nzwidth="0x1" edc:desc="Debouncer Enable of EXTINT15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
