Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/edc/PIC32CM2532JH01064.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TSCV" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x42001C24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TSC" edc:nzwidth="0x10" edc:desc="Timestamp Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TOCC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn-------------nnn" edc:por="11111111111111110000000000000000" edc:mclr="11111111111111110000000000000000" edc:impl="0xFFFF0007" edc:_addr="0x42001C28">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="ETOC" edc:nzwidth="0x1" edc:desc="Enable Timeout Counter"/>
            <edc:SFRFieldDef edc:cname="TOS" edc:nzwidth="0x2" edc:desc="Timeout Select">
              <edc:SFRFieldSemantic edc:cname="CONT" edc:desc="Continuout operation" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TXEF" edc:desc="Timeout controlled by TX Event FIFO" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RXF0" edc:desc="Timeout controlled by Rx FIFO 0" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RXF1" edc:desc="Timeout controlled by Rx FIFO 1" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="TOP" edc:nzwidth="0x10" edc:desc="Timeout Period"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TOCV" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000001111111111111111" edc:mclr="00000000000000001111111111111111" edc:impl="0xFFFF" edc:_addr="0x42001C2C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TOC" edc:nzwidth="0x10" edc:desc="Timeout Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x42001C30"/>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="ECR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x42001C40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TEC" edc:nzwidth="0x8" edc:desc="Transmit Error Counter"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x7" edc:desc="Receive Error Counter"/>
            <edc:SFRFieldDef edc:cname="RP" edc:nzwidth="0x1" edc:desc="Receive Error Passive"/>
            <edc:SFRFieldDef edc:cname="CEL" edc:nzwidth="0x8" edc:desc="CAN Error Logging"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="PSR" edc:nzwidth="0x20" edc:access="---------rrrrrrr-rrrrrrrrrrrrrrr" edc:por="00000000000000000000011100000111" edc:mclr="00000000000000000000011100000111" edc:impl="0x7F7FFF" edc:_addr="0x42001C44">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="LEC" edc:nzwidth="0x3" edc:desc="Last Error Code">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STUFF" edc:desc="Stuff Error" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FORM" edc:desc="Form Error" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="Ack Error" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="BIT1" edc:desc="Bit1 Error" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="BIT0" edc:desc="Bit0 Error" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CRC" edc:desc="CRC Error" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="NC" edc:desc="No Change" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x2" edc:desc="Activity">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Node is synchronizing on CAN communication" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Node is neither receiver nor transmitter" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RX" edc:desc="Node is operating as receiver" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TX" edc:desc="Node is operating as transmitter" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EP" edc:nzwidth="0x1" edc:desc="Error Passive"/>
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Warning Status"/>
            <edc:SFRFieldDef edc:cname="BO" edc:nzwidth="0x1" edc:desc="Bus_Off Status"/>
            <edc:SFRFieldDef edc:cname="DLEC" edc:nzwidth="0x3" edc:desc="Data Phase Last Error Code">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STUFF" edc:desc="Stuff Error" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FORM" edc:desc="Form Error" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="Ack Error" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="BIT1" edc:desc="Bit1 Error" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="BIT0" edc:desc="Bit0 Error" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CRC" edc:desc="CRC Error" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="NC" edc:desc="No Change" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RESI" edc:nzwidth="0x1" edc:desc="ESI flag of last received CAN FD Message"/>
            <edc:SFRFieldDef edc:cname="RBRS" edc:nzwidth="0x1" edc:desc="BRS flag of last received CAN FD Message"/>
            <edc:SFRFieldDef edc:cname="RFDF" edc:nzwidth="0x1" edc:desc="Received a CAN FD Message"/>
            <edc:SFRFieldDef edc:cname="PXE" edc:nzwidth="0x1" edc:desc="Protocol Exception Event"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCV" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
