Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/edc/PIC32CM2532JH01064.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="XIDFC" edc:nzwidth="0x20" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFFFF" edc:_addr="0x42002088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="FLESA" edc:nzwidth="0x10" edc:desc="Filter List Extended Start Address"/>
            <edc:SFRFieldDef edc:cname="LSE" edc:nzwidth="0x7" edc:desc="List Size Extended"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4200208C"/>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="XIDAM" edc:nzwidth="0x20" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00011111111111111111111111111111" edc:mclr="00011111111111111111111111111111" edc:impl="0x1FFFFFFF" edc:_addr="0x42002090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="EIDM" edc:nzwidth="0x1D" edc:desc="Extended ID Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="HPMS" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x42002094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="BIDX" edc:nzwidth="0x6" edc:desc="Buffer Index"/>
            <edc:SFRFieldDef edc:cname="MSI" edc:nzwidth="0x2" edc:desc="Message Storage Indicator">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No FIFO selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LOST" edc:desc="FIFO message lost" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FIFO0" edc:desc="Message stored in FIFO 0" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="FIFO1" edc:desc="Message stored in FIFO 1" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIDX" edc:nzwidth="0x7" edc:desc="Filter Index"/>
            <edc:SFRFieldDef edc:cname="FLST" edc:nzwidth="0x1" edc:desc="Filter List"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="NDAT1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="ND0" edc:nzwidth="0x1" edc:desc="New Data 0"/>
            <edc:SFRFieldDef edc:cname="ND1" edc:nzwidth="0x1" edc:desc="New Data 1"/>
            <edc:SFRFieldDef edc:cname="ND2" edc:nzwidth="0x1" edc:desc="New Data 2"/>
            <edc:SFRFieldDef edc:cname="ND3" edc:nzwidth="0x1" edc:desc="New Data 3"/>
            <edc:SFRFieldDef edc:cname="ND4" edc:nzwidth="0x1" edc:desc="New Data 4"/>
            <edc:SFRFieldDef edc:cname="ND5" edc:nzwidth="0x1" edc:desc="New Data 5"/>
            <edc:SFRFieldDef edc:cname="ND6" edc:nzwidth="0x1" edc:desc="New Data 6"/>
            <edc:SFRFieldDef edc:cname="ND7" edc:nzwidth="0x1" edc:desc="New Data 7"/>
            <edc:SFRFieldDef edc:cname="ND8" edc:nzwidth="0x1" edc:desc="New Data 8"/>
            <edc:SFRFieldDef edc:cname="ND9" edc:nzwidth="0x1" edc:desc="New Data 9"/>
            <edc:SFRFieldDef edc:cname="ND10" edc:nzwidth="0x1" edc:desc="New Data 10"/>
            <edc:SFRFieldDef edc:cname="ND11" edc:nzwidth="0x1" edc:desc="New Data 11"/>
            <edc:SFRFieldDef edc:cname="ND12" edc:nzwidth="0x1" edc:desc="New Data 12"/>
            <edc:SFRFieldDef edc:cname="ND13" edc:nzwidth="0x1" edc:desc="New Data 13"/>
            <edc:SFRFieldDef edc:cname="ND14" edc:nzwidth="0x1" edc:desc="New Data 14"/>
            <edc:SFRFieldDef edc:cname="ND15" edc:nzwidth="0x1" edc:desc="New Data 15"/>
            <edc:SFRFieldDef edc:cname="ND16" edc:nzwidth="0x1" edc:desc="New Data 16"/>
            <edc:SFRFieldDef edc:cname="ND17" edc:nzwidth="0x1" edc:desc="New Data 17"/>
            <edc:SFRFieldDef edc:cname="ND18" edc:nzwidth="0x1" edc:desc="New Data 18"/>
            <edc:SFRFieldDef edc:cname="ND19" edc:nzwidth="0x1" edc:desc="New Data 19"/>
            <edc:SFRFieldDef edc:cname="ND20" edc:nzwidth="0x1" edc:desc="New Data 20"/>
            <edc:SFRFieldDef edc:cname="ND21" edc:nzwidth="0x1" edc:desc="New Data 21"/>
            <edc:SFRFieldDef edc:cname="ND22" edc:nzwidth="0x1" edc:desc="New Data 22"/>
            <edc:SFRFieldDef edc:cname="ND23" edc:nzwidth="0x1" edc:desc="New Data 23"/>
            <edc:SFRFieldDef edc:cname="ND24" edc:nzwidth="0x1" edc:desc="New Data 24"/>
            <edc:SFRFieldDef edc:cname="ND25" edc:nzwidth="0x1" edc:desc="New Data 25"/>
            <edc:SFRFieldDef edc:cname="ND26" edc:nzwidth="0x1" edc:desc="New Data 26"/>
            <edc:SFRFieldDef edc:cname="ND27" edc:nzwidth="0x1" edc:desc="New Data 27"/>
            <edc:SFRFieldDef edc:cname="ND28" edc:nzwidth="0x1" edc:desc="New Data 28"/>
            <edc:SFRFieldDef edc:cname="ND29" edc:nzwidth="0x1" edc:desc="New Data 29"/>
            <edc:SFRFieldDef edc:cname="ND30" edc:nzwidth="0x1" edc:desc="New Data 30"/>
            <edc:SFRFieldDef edc:cname="ND31" edc:nzwidth="0x1" edc:desc="New Data 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="NDAT2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200209C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="ND32" edc:nzwidth="0x1" edc:desc="New Data 32"/>
            <edc:SFRFieldDef edc:cname="ND33" edc:nzwidth="0x1" edc:desc="New Data 33"/>
            <edc:SFRFieldDef edc:cname="ND34" edc:nzwidth="0x1" edc:desc="New Data 34"/>
            <edc:SFRFieldDef edc:cname="ND35" edc:nzwidth="0x1" edc:desc="New Data 35"/>
            <edc:SFRFieldDef edc:cname="ND36" edc:nzwidth="0x1" edc:desc="New Data 36"/>
            <edc:SFRFieldDef edc:cname="ND37" edc:nzwidth="0x1" edc:desc="New Data 37"/>
            <edc:SFRFieldDef edc:cname="ND38" edc:nzwidth="0x1" edc:desc="New Data 38"/>
            <edc:SFRFieldDef edc:cname="ND39" edc:nzwidth="0x1" edc:desc="New Data 39"/>
            <edc:SFRFieldDef edc:cname="ND40" edc:nzwidth="0x1" edc:desc="New Data 40"/>
            <edc:SFRFieldDef edc:cname="ND41" edc:nzwidth="0x1" edc:desc="New Data 41"/>
            <edc:SFRFieldDef edc:cname="ND42" edc:nzwidth="0x1" edc:desc="New Data 42"/>
            <edc:SFRFieldDef edc:cname="ND43" edc:nzwidth="0x1" edc:desc="New Data 43"/>
            <edc:SFRFieldDef edc:cname="ND44" edc:nzwidth="0x1" edc:desc="New Data 44"/>
            <edc:SFRFieldDef edc:cname="ND45" edc:nzwidth="0x1" edc:desc="New Data 45"/>
            <edc:SFRFieldDef edc:cname="ND46" edc:nzwidth="0x1" edc:desc="New Data 46"/>
            <edc:SFRFieldDef edc:cname="ND47" edc:nzwidth="0x1" edc:desc="New Data 47"/>
            <edc:SFRFieldDef edc:cname="ND48" edc:nzwidth="0x1" edc:desc="New Data 48"/>
            <edc:SFRFieldDef edc:cname="ND49" edc:nzwidth="0x1" edc:desc="New Data 49"/>
            <edc:SFRFieldDef edc:cname="ND50" edc:nzwidth="0x1" edc:desc="New Data 50"/>
            <edc:SFRFieldDef edc:cname="ND51" edc:nzwidth="0x1" edc:desc="New Data 51"/>
            <edc:SFRFieldDef edc:cname="ND52" edc:nzwidth="0x1" edc:desc="New Data 52"/>
            <edc:SFRFieldDef edc:cname="ND53" edc:nzwidth="0x1" edc:desc="New Data 53"/>
            <edc:SFRFieldDef edc:cname="ND54" edc:nzwidth="0x1" edc:desc="New Data 54"/>
            <edc:SFRFieldDef edc:cname="ND55" edc:nzwidth="0x1" edc:desc="New Data 55"/>
            <edc:SFRFieldDef edc:cname="ND56" edc:nzwidth="0x1" edc:desc="New Data 56"/>
            <edc:SFRFieldDef edc:cname="ND57" edc:nzwidth="0x1" edc:desc="New Data 57"/>
            <edc:SFRFieldDef edc:cname="ND58" edc:nzwidth="0x1" edc:desc="New Data 58"/>
            <edc:SFRFieldDef edc:cname="ND59" edc:nzwidth="0x1" edc:desc="New Data 59"/>
            <edc:SFRFieldDef edc:cname="ND60" edc:nzwidth="0x1" edc:desc="New Data 60"/>
            <edc:SFRFieldDef edc:cname="ND61" edc:nzwidth="0x1" edc:desc="New Data 61"/>
            <edc:SFRFieldDef edc:cname="ND62" edc:nzwidth="0x1" edc:desc="New Data 62"/>
            <edc:SFRFieldDef edc:cname="ND63" edc:nzwidth="0x1" edc:desc="New Data 63"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="RXF0C" edc:nzwidth="0x20" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF7FFFFF" edc:_addr="0x420020A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F0SA" edc:nzwidth="0x10" edc:desc="Rx FIFO 0 Start Address"/>
            <edc:SFRFieldDef edc:cname="F0S" edc:nzwidth="0x7" edc:desc="Rx FIFO 0 Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0WM" edc:nzwidth="0x7" edc:desc="Rx FIFO 0 Watermark"/>
            <edc:SFRFieldDef edc:cname="F0OM" edc:nzwidth="0x1" edc:desc="FIFO 0 Operation Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="RXF0S" edc:nzwidth="0x20" edc:access="------rr--rrrrrr--rrrrrr-rrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x33F3F7F" edc:_addr="0x420020A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="F0FL" edc:nzwidth="0x7" edc:desc="Rx FIFO 0 Fill Level"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0GI" edc:nzwidth="0x6" edc:desc="Rx FIFO 0 Get Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0PI" edc:nzwidth="0x6" edc:desc="Rx FIFO 0 Put Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0F" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Full"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:nzwidth="0x1" edc:desc="Rx FIFO 0 Message Lost"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
